Конфигурация/InformationRegisters/РасчетныеЦеныНРД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РасчетныеЦеныНРД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PRICE</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RATE</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RATE_LBOUND</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RATE_UBOUND</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>VERSION</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>METHOD_NUMBER</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TYPE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РасчетныеЦеныНРД/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	// Версия новых цен должна быть не ниже текущей
	СообщениеОбОшибке = Неопределено;
	Если Не ПроверитьВерсиюЦен(СообщениеОбОшибке) Тогда
		ВызватьИсключение СообщениеОбОшибке;	
	КонецЕсли;	
КонецПроцедуры

#Область Вспомогательные_функции

// Проверка версии цен НРД: версия новых цен должна быть не ниже текущей
Функция ПроверитьВерсиюЦен(СообщениеОбОшибке = Неопределено, НепрошедшиеПроверку = Неопределено)	
	// Если записи удаляются, то проверку не выполняем
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат Истина;	
	КонецЕсли;
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	_НовыйНаборЗаписей.Период,
		|	_НовыйНаборЗаписей.ЦеннаяБумага,
		|	_НовыйНаборЗаписей.Рынок,
		|	_НовыйНаборЗаписей.VERSION
		|ПОМЕСТИТЬ
		|	_НовыйНаборЗаписей
		|ИЗ
		|	&НовыйНаборЗаписей КАК _НовыйНаборЗаписей
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	РасчетныеЦеныНРД.Период,
		|	РасчетныеЦеныНРД.ЦеннаяБумага,
		|	РасчетныеЦеныНРД.Рынок,
		|	РасчетныеЦеныНРД.VERSION КАК VERSION,
		|	_НовыйНаборЗаписей.VERSION КАК VERSION_NEW 
		|ИЗ
		|	РегистрСведений.РасчетныеЦеныНРД КАК РасчетныеЦеныНРД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НовыйНаборЗаписей КАК _НовыйНаборЗаписей
		|		ПО _НовыйНаборЗаписей.Период = РасчетныеЦеныНРД.Период
		|			И _НовыйНаборЗаписей.ЦеннаяБумага = РасчетныеЦеныНРД.ЦеннаяБумага
		|			И _НовыйНаборЗаписей.Рынок = РасчетныеЦеныНРД.Рынок
		|			И _НовыйНаборЗаписей.VERSION < РасчетныеЦеныНРД.VERSION
		|");
	Запрос.УстановитьПараметр("НовыйНаборЗаписей", ЭтотОбъект.Выгрузить(, "Период, ЦеннаяБумага, Рынок, VERSION"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		НепрошедшиеПроверку = РезультатЗапроса.Выгрузить();
		
		// Формируем сообщение об ошибке
		КоличествоВыведенныхЗаписей = Мин(НепрошедшиеПроверку.Количество(), 3);
		
		ПредставлениеОшибочныхЗаписей = "";
		Для н = 1 По КоличествоВыведенныхЗаписей Цикл
			ПредставлениеОшибочныхЗаписей = ПредставлениеОшибочныхЗаписей 
				+ "[" + Формат(НепрошедшиеПроверку[н-1].Период, "ДФ=dd.MM.yyyy")
				+ "; " + Строка(НепрошедшиеПроверку[н-1].ЦеннаяБумага)
				+ "; ver. " + НепрошедшиеПроверку[н-1].VERSION
				+ " => " + ?(ЗначениеЗаполнено(НепрошедшиеПроверку[н-1].VERSION_NEW), НепрошедшиеПроверку[н-1].VERSION_NEW, """") + "]; "			
		КонецЦикла;
		ПредставлениеОшибочныхЗаписей = Лев(ПредставлениеОшибочныхЗаписей, СтрДлина(ПредставлениеОшибочныхЗаписей) - 2); 
		
		Если КоличествоВыведенныхЗаписей < НепрошедшиеПроверку.Количество() Тогда
			ПредставлениеОшибочныхЗаписей = ПредставлениеОшибочныхЗаписей + ", а также еще " + Строка(НепрошедшиеПроверку.Количество() - КоличествоВыведенныхЗаписей);  	
		КонецЕсли;
		
		СообщениеОбОшибке = "Версия цены НРД младше ранее зарегистрированной: " + ПредставлениеОшибочныхЗаписей;	
		
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина;
КонецФункции

#КонецОбласти
